In [7]:
import pandas as pd
d=pd.read_excel("duplicate.xlsx")
df=pd.DataFrame(d)
print(df)

        Name  Eng  Maths  Sci  Total
0        ali   33     56   77    166
1   nivedita   35     66   79    180
2    saksham   36     33   81    150
3      sonia   37     86   83    206
4   abhishek   38     96   33    167
5      rahul   39     33   87    159
6    abhinav   40    116   89    245
7   aliabbas   38     96   33    167
8   nivedita   35     66   79    180
9    saksham   38     96   33    167
10     sonia   33     56   77    166

In [8]:
df.loc[df['Total']<170]

        Name  Eng  Maths  Sci  Total
0        ali   33     56   77    166
2    saksham   36     33   81    150
4   abhishek   38     96   33    167
5      rahul   39     33   87    159
7   aliabbas   38     96   33    167
9    saksham   38     96   33    167
10     sonia   33     56   77    166

In [9]:
df.loc[(df['Eng']> 38) & (df['Maths']<50)]

    Name  Eng  Maths  Sci  Total
5  rahul   39     33   87    159

In [10]:
df.loc[(df['Eng']> 38) | (df['Maths']<50)]

      Name  Eng  Maths  Sci  Total
2  saksham   36     33   81    150
5    rahul   39     33   87    159
6  abhinav   40    116   89    245

In [11]:
df.loc[df['Name'].str.contains("k")]

       Name  Eng  Maths  Sci  Total
2   saksham   36     33   81    150
4  abhishek   38     96   33    167
9   saksham   38     96   33    167

In [12]:
df.loc[df['Name'].str.startswith("k")]

Empty DataFrame
Columns: [Name, Eng, Maths, Sci, Total]
Index: []

In [13]:
df.loc[df['Name'].str.endswith("k")]

       Name  Eng  Maths  Sci  Total
4  abhishek   38     96   33    167